app/Http/Controllers/User/DashboardController.php

    public function __construct()
    {
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'soleaspay' limit 1

    public function index()
    {
        $page_title = __("Dashboard");
        $user = auth()->user();
        $baseCurrency = Currency::default();
        $transactions = Transaction::auth()->latest()->take(5)->get();
        $totalAddMoney = Transaction::auth()->addMoney()->where('status',1)->sum('request_amount');
        $virtualCards = activeCardData()['active_cards'];
        $totalGiftCards = GiftCard::auth()->count();
        //session(['test'=>120]);

        $rate = ExchangeRate::where('currency_code','XAF')->first();
---
select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and `status` = 1
select count(*) as aggregate from `gift_cards` where `user_id` = 1
select * from `exchange_rates` where `currency_code` = 'XAF' limit 1

    public function changeApi(Request $request){
        $validator = Validator::make($request->all(),[
            'api_method_app'=> 'required|in:flutterwave,sudo,stripe,strowallet,soleaspay,eversend,maplerad'
        ]);
        $user =User::where('id',auth()->user()->id)->first();

        if($validator->fails()) {
            //dump($validator);
            return back()->withErrors($validator)->withInput();
        }
        $user->name_api=$request->api_method_app;
        $user->save();
---
select * from `users` where `id` = 1 limit 1
update `users` set `name_api` = 'maplerad', `users`.`updated_at` = '2025-01-21 00:38:49' where `id` = 1