app/Http/Controllers/User/EversendVirtualCardController.php

    public function index()
    {
        // Update card details
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $myCards = EversendVirtualCard::where('user_id',auth()->user()->id)->where('status','terminating')->get();
---
select * from `eversend_virtual_cards` where `user_id` = 1 and `status` = 'terminating'