app/Http/Controllers/User/EversendVirtualCardController.php

select * from `virtual_card_apis` where `name` = 'eversend' limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();

select * from `virtual_card_apis` where `name` = 'eversend' limit 1
select * from `eversend_virtual_cards` where `user_id` = 1
---
    public function index()
    {
        // Update card details
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $myCards = EversendVirtualCard::where('user_id',auth()->user()->id)->get();

select * from `eversend_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `eversend_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card_eversend' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_eversend' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'withdraw_card_eversend' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 10
---
           }
        }
        $page_title = __("Virtual Card");
        $myCards = EversendVirtualCard::where('user_id',auth()->user()->id)->get();
        $totalCards = EversendVirtualCard::where('user_id',auth()->user()->id)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(10)->get();

select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
---
    public function cardDetails($card_id)
    {
        $page_title = __("Card Details");
        $myCard = EversendVirtualCard::where('card_id',$card_id)->first();
        $cardApi = $this->api;
        //dd($myCard->user());
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();

select * from `user_wallets` where `user_id` = 1 limit 1
---
    public function cardBuy(Request $request)
    {
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        if (!$this->api->is_created_card) {
            return back()->with(['error' => [__('the card purchase is temporary deactivate for this type of card')]]);
        }
        $user = auth()->user();
        //dd($request);
        if($user->eversend_customer == null){
            $request->validate([
                'card_amount'       => 'required|numeric|gt:0|min:1',
                'first_name'        => ['required', 'string', 'regex:/^[^0-9\W]+$/'],
                'last_name'         => ['required', 'string', 'regex:/^[^0-9\W]+$/'],
                'email'    => 'required|string',
                'dob' => 'required|string',
                'id_number' => 'required|numeric|max:9',
                'isNonSubscription' => 'required|string',
            ], [
                'first_name.regex'  => 'The First Name field should only contain letters and cannot start with a number or special character.',
                'last_name.regex'   => 'The Last Name field should only contain letters and cannot start with a number or special character.',
            ]);
        }else {
            $request->validate([
                'card_amount' => 'required|numeric|gt:0|min:1',
            ]);
        }
        //dd($request);
        $amount = $request->card_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();

select * from `transaction_settings` where `slug` = 'virtual_card_eversend' and `status` = 1 limit 1
---
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $cardCharge = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();

select * from `virtual_card_apis` where `name` = 'eversend' limit 1
select * from `eversend_virtual_cards` where `user_id` = 1 and `id` = '2' limit 1
select * from `transaction_settings` where `slug` = 'withdraw_card_eversend' and `status` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
---
    public function cardWithdraw(Request $request){
        $request->validate([
            'id' => 'required|integer',
            'fund_amount' => 'required|numeric|gt:0',
        ]);
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        if (!$this->api->is_withdraw) {
            return back()->with(['error' => [__('withdrawal of money from the card is temporarily disabled for this type of card')]]);
        }
        $user = auth()->user();
        $myCard =  EversendVirtualCard::where('user_id',$user->id)->where('id',$request->id)->first();

        if(!$myCard){
            return back()->with(['error' => [__('Something Is Wrong In Your Card')]]);
        }

        $amount = $request->fund_amount;
        $cardCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $wallet = UserWallet::where('user_id',$user->id)->first();

select * from `virtual_card_apis` where `name` = 'eversend' limit 1
---
        if($payable > $myCard->amount ){
            return back()->with(['error' => [__('Sorry, insufficient balance')]]);
        }
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();

select * from `user_wallets` where `user_id` = 1 limit 1
---
        curl_close($curl);
        //dd($result);
        $account_amount=$myCard->amount-$amount;
        $authWalle=UserWallet::where('user_id',$user->id)->first();

select * from `eversend_virtual_cards` where `id` = '2' limit 1
---
    public function cardBlockUnBlock(Request $request) {
       // dd($request);
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $public_key=$this->api->config->eversend_public_key;
        $secret_key=$this->api->config->eversend_secret_key;
        $validated = $validator->safe()->all();
        //return $validated;
        if($request->status == 1 ){
            $card = EversendVirtualCard::where('id',$request->data_target)->first();

select * from `eversend_virtual_cards` where `id` = '2' limit 1
---


        }else{
            $card = EversendVirtualCard::where('id',$request->data_target)->first();