app/Http/Controllers/User/MapleradVirtualCardController.php

select * from `virtual_card_apis` where `name` = 'maplerad' limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();

select * from `virtual_card_apis` where `name` = 'maplerad' limit 1
select * from `maplerad_virtual_cards` where `user_id` = 1
---
    public function index()
    {
        // Update card details
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $myCards = MapleradVirtualCard::where('user_id',auth()->user()->id)->get();

select * from `transaction_settings` where `slug` = 'virtual_card_maplerad' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_maplerad' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'withdraw_card_maplerad' and `status` = 1 limit 1
select * from `maplerad_virtual_cards` where `user_id` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 10
---
        $page_title = __("Virtual Card");
        $myCards = MapleradVirtualCard::where('user_id',auth()->user()->id)->where('is_deleted',false)->get();
        $totalCards = MapleradVirtualCard::where('user_id',auth()->user()->id)->where('is_deleted',false)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(10)->get();

select * from `maplerad_virtual_cards` where `card_id` = 'e33537c9-27dc-4715-a055-c9bb6ae5d6ca' limit 1
select * from `transaction_settings` where `slug` = 'withdraw_card_maplerad' and `status` = 1 limit 1
---
    public function cardDetails($card_id)
    {
        $page_title = __("Card Details");
        $myCard = MapleradVirtualCard::where('card_id',$card_id)->first();
        $cardApi = $this->api;
        //dd($myCard->user());
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();

select * from `maplerad_virtual_cards` where `user_id` = 1
---
    public function deleteCard(Request $request){
        $myCard = MapleradVirtualCard::where('id',$request->card_id)->first();

select * from `virtual_card_apis` where `name` = 'maplerad' limit 1
select * from `maplerad_virtual_cards` where `user_id` = 1 and `id` = '2' limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_maplerad' and `status` = 1 limit 1
---
    public function cardFundConfirm(Request $request){
        $request->validate([
            'id' => 'required|integer',
            'fund_amount' => 'required|numeric|gt:0',
        ]);
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        if (!$this->api->is_rechargeable) {
            return back()->with(['error' => [__('card top-up is temporarily disabled for this card type')]]);
        }
        //dd($request);
        $user = auth()->user();
        $myCard =  MapleradVirtualCard::where('user_id',$user->id)->where('id',$request->id)->first();

        if(!$myCard){
            return back()->with(['error' => [__('Something Is Wrong In Your Card')]]);
        }

        $amount = $request->fund_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        //dd($request);
        $cardCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();

select * from `virtual_card_apis` where `name` = 'maplerad' limit 1
---
        if($payable > $wallet->balance ){
            return back()->with(['error' => [__('Sorry, insufficient balance')]]);
        }
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();

select * from `virtual_card_apis` where `name` = 'maplerad' limit 1
---
    public function cardBlockUnBlock(Request $request) {
       // dd($request);
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (92, 0, 0, 0, '2025-01-03 21:44:30')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('CARD-FUND', 1, '{\"title\":\"Card Fund\",\"message\":\"Recharge de carte r\u00e9ussie Carte:  3 USD\",\"image\":\"http:\/\/localhost:8000\/public\/backend\/images\/default\/profile-default.webp\"}', '2025-01-03 21:44:30', '2025-01-03 21:44:30')
---
    public function insertFundCardCharge($fixedCharge,$percent_charge, $total_charge,$user,$id,$masked_card,$amount) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Card Fund",
                'message'       => __("Card fund successful card:")." ".$masked_card.' '.getAmount($amount,2).' '.get_default_currency_code(),
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::CARD_FUND,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 10.1628, `user_wallets`.`updated_at` = '2025-01-03 21:44:30' where `id` = 1
---
    public function insertCardPenality( $trx_id,$user,$wallet,$amount, $myCard ,$payable) {
        $trx_id = $trx_id;
        $authWallet = $wallet;
        $afterCharge = ($authWallet->balance - $amount);
        $details =[
            'card_info' =>   $myCard??''
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::VIRTUALCARD,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::CARD_PAY_PENALITY," ")),
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::RECEIVED,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);