app/Http/Controllers/User/ProfileController.php

update `users` set `email` = 'nganjienzatsi@gmail.com', `users`.`updated_at` = '2024-12-11 04:59:52' where `id` = 1
---
        }

        try{
            auth()->user()->update($validated);