app/Http/Controllers/User/SoleaspayVirtualCardController.php

    public function __construct()
    {
        //$user=User::where('id',auth()->user()->id)->first();
        //dump(auth()->user());
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'eversend' limit 1

    public function index()
    {
        //dump($this->api);
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        // Update card details
        $myCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->get();
---
select * from `virtual_card_apis` where `name` = 'soleaspay' limit 1
select * from `soleaspay_virtual_cards` where `user_id` = 1

            }
        }
        $page_title = __("Virtual Card");
        $myCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->get();
        $totalCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(10)->get();
---
select * from `soleaspay_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `soleaspay_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card_soleaspay' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 10