app/Http/Controllers/User/SoleaspayVirtualCardController.php

select * from `soleaspay_virtual_cards` where `user_id` = 1 and `is_deleted` = 0
---
    public function index()
    {
        //dump($this->api);
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        // Update card details
        $myCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->where('is_deleted',false)->get();

select * from `soleaspay_virtual_cards` where `user_id` = 1 and `is_deleted` = 0
select count(*) as aggregate from `soleaspay_virtual_cards` where `user_id` = 1 and `is_deleted` = 0
---
            }
        }
        $page_title = __("Virtual Card");
        $myCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->where('is_deleted',false)->latest()->get();
        $totalCards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->where('is_deleted',false)->count();

select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---
    public function cardDetails($card_id)
    {
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $page_title = __("Card Details");
        $myCard = SoleaspayVirtualCard::where('card_id',$card_id)->first();
        $cardApi = $this->api;
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();