app/Http/Controllers/User/StripeVirtualController.php

    public function __construct()
    {
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'soleaspay' limit 1

    public function index()
    {
        $page_title = __("Virtual Card");
        $myCards = StripeVirtualCard::where('user_id',auth()->user()->id)->get();
        $totalCards = StripeVirtualCard::where('user_id',auth()->user()->id)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();
---
select * from `stripe_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `stripe_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5

    public function cardBuy(Request $request)
    {
        $request->validate([
            'fund_amount' => 'required|numeric|gt:0',
        ]);

        $user = User::where('id',auth()->user()->id)->first();
        $amount = $request->fund_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1