app/Http/Controllers/User/StrowalletVirtualController.php

    public function index()
    {
        $page_title     = __("Virtual Card");
        $myCards        = StrowalletVirtualCard::where('user_id', auth()->user()->id)->latest()->limit($this->card_limit)->get();
        $user           = auth()->user();
        $customer_email = $user->strowallet_customer->customerEmail??false;

        if($customer_email === false){
            $customer_card  = 0;
        }else{
            $customer_card  = StrowalletVirtualCard::where('customer_email',$customer_email)->count();
        }
        $cardCharge       = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
        $transactions     = Transaction::auth()->virtualCard()->latest()->take(5)->get();
---
select * from `strowallet_virtual_cards` where `user_id` = 1 order by `created_at` desc limit 10000
select * from `transaction_settings` where `slug` = 'virtual_card_strowallet' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_strowallet' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5