app/Http/Controllers/User/StrowalletVirtualController.php

    public function __construct()
    {
        $cardApi = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'strowallet' limit 1

    public function index()
    {
        $page_title     = __("Virtual Card");
        $this->api=VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
        $myCards        = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_deleted',false)->latest()->limit($this->card_limit)->get();
        $user           = auth()->user();
        $customer_card = '';//$user->strowallet_customer->customerEmail??false;

        /*if($customer_email === false){
            $customer_card  = 0;
        }else{
            $customer_card  = StrowalletVirtualCard::where('customer_email',$customer_email)->count();
        }*/
        if(count($myCards)>0){
            foreach($myCards as $myCard){
                $card_details   = card_details($myCard->card_id,$this->api->config->strowallet_public_key,$this->api->config->strowallet_url);
                $myCard->card_status               = $card_details['data']['card_detail']['card_status'];
            $myCard->card_name               = $card_details['data']['card_detail']['card_name'];
            $myCard->card_number               = $card_details['data']['card_detail']['card_number'];
            $myCard->last4                     = $card_details['data']['card_detail']['last4'];
            $myCard->cvv                       = $card_details['data']['card_detail']['cvv'];
            $myCard->expiry                    = $card_details['data']['card_detail']['expiry'];
            $myCard->balance                    = $card_details['data']['card_detail']['balance'];
            $myCard->save();
            }
        }
        $myCards        = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_deleted',false)->latest()->limit($this->card_limit)->get();
        $cardCharge       = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
        $transactions     = Transaction::auth()->virtualCard()->latest()->take(5)->get();
        $cardWithdrawCharge = TransactionSetting::where('slug','withdraw_card_'.auth()->user()->name_api)->where('status',1)->first();
---
select * from `virtual_card_apis` where `name` = 'strowallet' limit 1
select count(*) as aggregate from `strowallet_virtual_cards` where `customer_email` = 'nganjienzatsi@gmail.com'
select * from `strowallet_virtual_cards` where `user_id` = 1 and `is_deleted` = 0 order by `created_at` desc limit 10000
select * from `transaction_settings` where `slug` = 'virtual_card_strowallet' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_strowallet' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
select * from `transaction_settings` where `slug` = 'withdraw_card_strowallet' and `status` = 1 limit 1

    public function payPenality(Request $request){
        $request->validate([
            'card_id' => 'required|integer',
        ]);
        $this->api=VirtualCardApi::where('name',auth()->user()->name_api)->first();
        $user = auth()->user();
        $myCard =  StrowalletVirtualCard::where('user_id',$user->id)->where('id',$request->card_id)->first();
        $amount=$this->api->penality_price;
        $wallet = UserWallet::where('user_id',$user->id)->first();
---
select * from `virtual_card_apis` where `name` = 'strowallet' limit 1
select * from `strowallet_virtual_cards` where `user_id` = 1 and `id` = '7' limit 1
select * from `user_wallets` where `user_id` = 1 limit 1

    public function createPage(){
        $page_title = __("Create Virtual Card");
        $user       = userGuard()['user'];
        $user = User::where('id',$user->id)->first();
        $cardCharge     = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->where('status',1)->first();
---
select * from `users` where `id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card_strowallet' and `status` = 1 limit 1