app/Http/Helpers/helpers.php

function getCurrentsApi(){
    //$cur=auth()->user()->name_api;
    //$api = VirtualCardApi::where('name',$cur->name)->first();
    //return $api->config->name;
    $currentsApi=VirtualCardApi::select('name')->get();
---
select `name` from `virtual_card_apis`

function get_admin_notifications()
{
    $notifications = AdminNotification::auth()->whereNot('type',NotificationConst::SIDE_NAV)->latest()->paginate(10);
---
select count(*) as aggregate from `admin_notifications` where `admin_id` = 1 and not `type` = 'SIDE_NAV'

function authWalletBalance(){
    $wallet = UserWallet::where('user_id',auth()->user()->id)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1

function get_user_notifications()
{
    $user = auth()->user();
    $notifications = UserNotification::auth()->latest()->take(4)->get();
---
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 4

function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `status` = 1 limit 1

function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `status` = 1 limit 1

function virtual_card_system($name)
{
    $method = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'eversend' limit 1

 function activeCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  VirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = VirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();
    }elseif(virtual_card_system('sudo') == "sudo"){
        $virtual_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->count();
        $inactive_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',0)->count();
    }elseif(virtual_card_system('stripe') == "stripe"){
        $virtual_cards = StripeVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  StripeVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->count();
        $inactive_cards = StripeVirtualCard::where('user_id',auth()->user()->id)->where('status',0)->count();
    }elseif(virtual_card_system('strowallet') == "strowallet"){
        $virtual_cards = StrowalletVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  StrowalletVirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = StrowalletVirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();
    }elseif(virtual_card_system('soleaspay') == "soleaspay"){
        $virtual_cards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  SoleaspayVirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = SoleaspayVirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();
    }elseif(virtual_card_system('eversend') == "eversend"){
        $virtual_cards = EversendVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  EversendVirtualCard::where('user_id',auth()->user()->id)->where('is_non_subscription',1)->count();
        $inactive_cards = EversendVirtualCard::where('user_id',auth()->user()->id)->where('is_non_subscription',0)->count();
---
select count(*) as aggregate from `stripe_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 1
select count(*) as aggregate from `stripe_virtual_cards` where `user_id` = 1 and `status` = 0
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `soleaspay_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `soleaspay_virtual_cards` where `user_id` = 1 and `is_active` = 0
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 0
select count(*) as aggregate from `soleaspay_virtual_cards` where `user_id` = 1 and `is_active` = 1
select count(*) as aggregate from `eversend_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `eversend_virtual_cards` where `user_id` = 1 and `is_non_subscription` = 1

function module_access($key,$module = null)
{
    if (!$module) {
        $module = ModuleSetting::query();
    }
    return $module->where('slug',$key)->first();
---
select * from `module_settings` where `slug` = 'virtual-card' limit 1

function module_access_api($key)
{
    $module = ModuleSetting::where('slug',$key)->first();
---
select * from `module_settings` where `slug` = 'virtual-card' limit 1