app/Http/Helpers/strowallet-card.php

select * from `virtual_card_apis` where `name` = 'strowallet' limit 1
---
function card_details($card_id,$public_key,$base_url){
    $method = VirtualCardApi::where('name',Auth::check()?auth()->user()->name_api:Admin::first()->name_api)->first();

select * from `strowallet_virtual_cards` where `user_id` = 1 and `card_id` = 'a06031d8-71cf-40bd-993c-1c9bcdc21252' limit 1
---
function updateStroWalletCardBalance($user,$card_id,$response){
    $card = StrowalletVirtualCard::where('user_id',$user->id)->where('card_id',$card_id)->first();