app/Traits/PaymentGateway/PaiementProTrait.php

select * from `basic_settings` limit 1
---
    public function paiementproInit($output = null)
    {
        if(!$output) $output = $this->output;

        $credentials = $this->getpaiementproCredentials($output);

        $reference = $this->generatepaiementproReference();
        $paiementmode=$output['paiementmode']?$output['paiementmode']:'AIRTELNG';

        $amount = $output['amount']->total_amount ? number_format($output['amount']->total_amount, 2, '.', '') : 0;
        $amount =round($amount);

        if(auth()->guard(get_auth_guard())->check()){
            $user = auth()->guard(get_auth_guard())->user();
            $user_email = $user->email;
            $user_phone = $user->full_mobile ?? '';
            $user_name = $user->firstname.' '.$user->lastname ?? '';
            $user_lastname=$user->lastname;
        }

        $success_url = route('user.add.money.paiementpro.success');
        //$url_site=route('user.add.money');
        $fails_url = route('user.add.money.paiementpro.fails');
        $basic_setting = BasicSettings::first();

select * from `basic_settings` limit 1
---
    public function generatepaiementproReference()
    {
        $basic_setting = BasicSettings::first();