app/Traits/PaymentGateway/SoleaspayTrait.php

select * from `basic_settings` limit 1
---
    public function soleaspayInit($output = null)
    {
        if(!$output) $output = $this->output;

        $credentials = $this->getSoleaspayCredentials($output);

        $reference = $this->generateSoleaspayReference();

        $amount = $output['amount']->total_amount ? number_format($output['amount']->total_amount, 2, '.', '') : 0;

        if(auth()->guard(get_auth_guard())->check()){
            $user = auth()->guard(get_auth_guard())->user();
            $user_email = $user->email;
            $user_phone = $user->full_mobile ?? '';
            $user_name = $user->firstname.' '.$user->lastname ?? '';
        }

        $success_url = route('user.add.money.soleaspay.success');
        $fails_url = route('user.add.money.soleaspay.fails');
        $basic_setting = BasicSettings::first();

select * from `basic_settings` limit 1
---
    public function generateSoleaspayReference()
    {
        $basic_setting = BasicSettings::first();