app/Http/Controllers/SiteController.php

    public function home(){
        $basic_settings = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function changeLanguage($lang = null)
    {
        $language = Language::where('code', $lang)->first();
---
select * from `languages` where `code` = 'fr' limit 1