app/Http/Controllers/UserNoticeController.php

    public function update(Request $request){
        $validator = Validator::make($request->all(),[
            'name'     => "required|string|max:100",
            'rating'     => "required|string|min:0|max:5",
            'details'   => "required|string",
            'user_notice_id'=>"required|integer"
        ]);
        $validated = $validator->validate();
        try{
            $user_notice=UserNotice::find($request->user_notice_id);
---
select * from `user_notices` where `user_notices`.`id` = '1' limit 1