app/Http/Controllers/UserNoticeController.php

select * from `user_notices` where `user_id` = 1 order by `id` desc
select * from `admins` limit 1
select * from `users` where `id` = 1 limit 1
insert into `user_notices` (`name`, `rating`, `details`, `designation`, `image`, `user_id`, `updated_at`, `created_at`) values ('nganjie', '3', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'User', 'http://localhost:8000/public/backend/images/default/profile-default.webp', 1, '2024-12-12 19:01:16', '2024-12-12 19:01:16')
---
    public function store(Request $request){
        $validator = Validator::make($request->all(),[
            'name'     => "required|string|max:100",
            'rating'     => "required|string|min:0|max:5",
            'details'   => "required|string",
        ]);
        $user_notices = UserNotice::auth()->orderByDesc("id")->get();

        $total=count($user_notices);
        $admin=Admin::first();

        if($total>=$admin->limit_notice){
            //$error = ['error' => [__('Something Is Wrong In Your Card')]];
            return back()->with(['error' => [__('Please follow the notice limit')]]);
        }
        //dump($total);
        //dd($admin);
        $validated = $validator->validate();
        $validated['designation']="User";
        $validated['image']=auth()->user()->userImage;
        //if(!auth()->user()->image)
        //dd($validated);
        $user =User::Where('id',auth()->user()->id)->first();
        $notice= new UserNotice($validated);
        $user->userNotice()->save($notice);