app/Providers/CustomServiceProvider.php

    public function register()
    {
        //dd("un monde de fou");
        //dd(Session::get('user_id'));

        $this->startingPoint();
        view()->composer('*', function ($view)
    {
       // $cart = Cart::where('user_id', Auth::user()->id);
       if(Auth::check())
       {
        $view_card=[];
        $view_card['card_details']= VirtualCardApi::where('name',Auth::user()->name_api)->first();
        $view_card['card_limit'] = VirtualCardApi::where('name',Auth::user()->name_api)->first()->card_limit;
        $view_card['card_api'] = VirtualCardApi::where('name',Auth::user()->name_api)->first();
        $view_card['cardCharge'] = TransactionSetting::where('slug','virtual_card_'.Auth::user()->name_api)->where('status',1)->first();
        $view_card['cardReloadCharge']             = TransactionSetting::where('slug','reload_card_'.auth()->user()->name_api)->where('status',1)->first();
---
select * from `virtual_card_apis` where `name` = 'strowallet' limit 1
select * from `virtual_card_apis` where `name` = 'soleaspay' limit 1
select * from `transaction_settings` where `slug` = 'reload_card_strowallet' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card_soleaspay' and `status` = 1 limit 1