app/Http/Controllers/Admin/TrxSettingsController.php

    public function index()
    {
        $page_title = __("Fees & Charges");
        $admin =Admin::where('id',auth()->user()->id)->first();
        $transaction_charges = TransactionSetting::where('slug','virtual_card_'.auth()->user()->name_api)->first();
        if(!($transaction_charges))
        {
            //echo "un monde de fou";
            $transaction_charges = TransactionSetting::whereIn('slug',['transfer-money','reload_card','gift_card','virtual_card'])->get();
---
select * from `admins` where `id` = 1 limit 1
select * from `transaction_settings` where `slug` LIKE 'virtual_card_%' or `slug` != 'virtual_card'
select * from `transaction_settings` where `slug` in ('transfer-money', 'reload_card', 'gift_card', 'virtual_card')

    public function trxChargeUpdate(Request $request) {
        $admin =Admin::where('id',auth()->user()->id)->first();
        $slug =$request->slug;

        if(Str::contains($request->slug,"virtual_card"))
        {
            $transaction_setting = TransactionSetting::where('slug',$request->slug.'_'.$admin->name_api)->first();
            if(!$transaction_setting&&$slug=="virtual_card"){
                $slug=$request->slug.'_'.$admin->name_api;
            }

        }
       //dd($slug);
        $validator = Validator::make($request->all(),[
            'slug'                              => 'required|string',
            $request->slug.'_fixed_charge'      => 'required|numeric',
            $request->slug.'_percent_charge'    => 'required|numeric',
            $request->slug.'_fixed_month_charge'      => 'numeric',
            $request->slug.'_fixed_final_charge'    => 'numeric',
            $request->slug.'_min_limit'         => 'required|numeric',
            $request->slug.'_max_limit'         => 'required|numeric',
            $request->slug.'_daily_limit'       => 'sometimes|required|numeric',
            $request->slug.'_monthly_limit'     => 'sometimes|required|numeric',
        ]);
        $validated = $validator->validate();

        $transaction_setting = TransactionSetting::where('slug',$slug)->first();
---
select * from `admins` where `id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card_eversend' limit 1
select * from `transaction_settings` where `slug` = 'reload_card' limit 1


        }else{
            try{
                $transaction_setting->update($validated);
---
update `transaction_settings` set `min_limit` = '90', `transaction_settings`.`updated_at` = '2024-11-06 07:12:47' where `id` = 3