app/Http/Controllers/Admin/UserCareController.php

                $mapl=MapleradVirtualCard::where('card_id',$data['card_id'])->first();
                if($mapl){
                    $user_ids[]=$mapl->user_id;
                    $us=User::find($mapl->user_id);
---
select * from `users` where `users`.`id` = '1' limit 1