app/Http/Controllers/Admin/UserCareController.php

    public function KycVerified()
    {
        $page_title =__( "KYC Verified Users");
        $users = User::kycVerified()->orderBy('id', 'desc')->paginate(8);
---
select * from `users` where `kyc_verified` = 3 order by `id` desc limit 8 offset 0
select count(*) as aggregate from `users` where `kyc_verified` = 3

    public function sendCopyMailUsers(Request $request){
        //dd($request);
        $request->validate([
            'user_type'     => "required|string|max:30",
        ]);

        $users = [];
        switch($request->user_type) {
            case "active";
                $users = User::active()->get();
                break;
            case "all";
                $users = User::select(['username','email'])->get();
                break;
            case "email_verified";
                $users = User::emailVerified()->select(['username','email'])->get();
                break;
                case "kyc_verified";
                $users = User::kycVerified()->get();
                break;
            case "kyc_unverified";
                $users = User::kycUnerified()->get();
                break;
            case "kyc_pending";
                $users = User::KycPending()->get();
                break;
            case "kyc_rejected";
                $users = User::KycRejected()->get();
---
select * from `users` where `username` = 'nganjie' limit 1

    public function walletBalanceUpdate(Request $request,$username) {
        $validator = Validator::make($request->all(),[
            'type'      => "required|string|in:add,subtract",
            'wallet'    => "required|numeric|exists:user_wallets,id",
            'amount'    => "required|numeric",
            'remark'    => "required|string|max:200",
        ]);

        if($validator->fails()) {
            return back()->withErrors($validator)->withInput()->with('modal','wallet-balance-update-modal');
        }

        $validated = $validator->validate();
        $user_wallet = UserWallet::whereHas('user',function($q) use ($username){
            $q->where('username',$username);
        })->find($validated['wallet']);
---
select * from `user_wallets` where exists (select * from `users` where `user_wallets`.`user_id` = `users`.`id` and `username` = 'nganjie') and `user_wallets`.`id` = '1' limit 1

                    break;
            }

            $inserted_id = DB::table("transactions")->insertGetId([
                'admin_id'          => auth()->user()->id,
                'user_id'           => $user_wallet->user->id,
                'user_wallet_id'    => $user_wallet->id,
                'type'              => PaymentGatewayConst::TYPEADDSUBTRACTBALANCE,
                'attribute'         => PaymentGatewayConst::RECEIVED,
                'trx_id'            => generate_unique_string("transactions","trx_id",16),
                'request_amount'    => $validated['amount'],
                'payable'           => $validated['amount'],
                'available_balance' => $user_wallet_balance,
                'remark'            => $validated['remark'],
                'created_at'        => now(),
                'status'            => GlobalConst::SUCCESS,
            ]);


            DB::table('transaction_charges')->insert([
                'transaction_id'    => $inserted_id,
                'percent_charge'    => 0,
                'fixed_charge'      => 0,
                'total_charge'      => 0,
                'created_at'        => now(),
            ]);
---
insert into `transactions` (`admin_id`, `user_id`, `user_wallet_id`, `type`, `attribute`, `trx_id`, `request_amount`, `payable`, `available_balance`, `remark`, `created_at`, `status`) values (1, 1, 1, 'ADD-SUBTRACT-BALANCE', 'RECEIVED', 'ffApsD1262zjKs6a', '15', '15', -2.1028, 'abc un monde de fou', '2025-01-21 00:33:49', 1)
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (123, 0, 0, 0, '2025-01-21 00:33:49')


            $mac = "";

            DB::table("transaction_devices")->insert([
                'transaction_id'=> $inserted_id,
                'ip'            => $client_ip,
                'mac'           => $mac,
                'city'          => $location['city'] ?? "",
                'country'       => $location['country'] ?? "",
                'longitude'     => $location['lon'] ?? "",
                'latitude'      => $location['lat'] ?? "",
                'timezone'      => $location['timezone'] ?? "",
                'browser'       => $agent->browser() ?? "",
                'os'            => $agent->platform() ?? "",
            ]);

            $user_wallet->save();
---
insert into `transaction_devices` (`transaction_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`) values (123, '::1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows')
update `user_wallets` set `balance` = -2.1028, `user_wallets`.`updated_at` = '2025-01-21 00:33:50' where `id` = 1

                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::BALANCE_UPDATE,
                'user_id'  => $user_wallet->user->id,
                'message'   => $notification_content,
            ]);
---
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('BALANCE_UPDATE', 1, '{\"title\":\"Update Balance\",\"message\":\"Your Wallet (USD) balance has been update\",\"time\":\"il y a 1 seconde\",\"image\":\"http:\/\/localhost:8000\/public\/backend\/images\/default\/profile-default.webp\"}', '2025-01-21 00:33:50', '2025-01-21 00:33:50')