app/Http/Controllers/Admin/VirtualCardController.php

            return back()->withErrors($validator)->withInput();
        }
        //dd($request);
        $admin =Admin::where('id',auth()->user()->id)->first();
---
select * from `admins` where `id` = 1 limit 1

        $data = array_filter($request->except('_token','api_method','_method','card_details','image','card_limit'));
        //dump($currentApi->name);
        if($existApi){
            $api = VirtualCardApi::where('name',$admin->name_api)->first();
---
select * from `virtual_card_apis` where `name` = 'maplerad' limit 1