app/Http/Controllers/Admin/VirtualCardController.php

select * from `admins` where `id` = 1 limit 1
select * from `virtual_card_apis` where `name` = 'strowallet' limit 1
---
    public function cardApi()
    {
        $page_title = __("Setup Virtual Card Api");
        //$this->createApiAppElemet();
        $admin =Admin::where('id',auth()->user()->id)->first();
        $api = VirtualCardApi::where('name',$admin->name_api)->first();

select * from `api_apps`
select * from `admins` where `id` = 1 limit 1
---
    public function cardApiChange(Request $request){
        $validator = Validator::make($request->all(),[
            'api_method_app'=> 'required|in:flutterwave,sudo,stripe,strowallet,soleaspay,eversend'
        ]);
        $admin =Admin::where('id',auth()->user()->id)->first();

select * from `admins` where `id` = 1 limit 1
select * from `virtual_card_apis` where `name` = 'eversend' limit 1
---
            return back()->withErrors($validator)->withInput();
        }
        //dd($request);
        $admin =Admin::where('id',auth()->user()->id)->first();
        $existApi=VirtualCardApi::where('name',$admin->name_api)->first();

select * from `virtual_card_apis` where `name` = 'eversend' limit 1
---
        $data = array_filter($request->except('_token','api_method','_method','card_details','image','card_limit'));
        //dump($currentApi->name);
        if($existApi){
            $api = VirtualCardApi::where('name',$admin->name_api)->first();